#รับรหัสสินค้า ราคาต่อชิ้น และจำนวน 
#เเล้วคำนวร ส่วนลด = ราคาสินค้า * จำนวน * 3% (ถ้าเป็นหมวดที่ 1)
#ถ้าเป็นหมวดที่ สอง ถ้าน้อยกว่าสามชิ้น ลด 3% ถ้ามากกว่า ลด 5% 
#ถ้าเป็นหมวดอื่น ไม่มีส่วนลด 
code = input("ใส่รหัสสินค้า : ")
price = int(input("ใส่ราคาสินค้า: "))
order = int(input("ใส่จำนวนสินค้า: "))

if code[1] == '1':
    print('สินค้าหมวดที่ 1')
    sale = price * order * 0.97
    print("ราคาสินค้ารวมล่วนลด :฿ ",sale )
elif code[1] == '2':
    print('สินค้าหมวดที่ 2')
    if order <= 3:
        sale = price * order * 0.97 
        print("ราคาสินค้ารวมส่วนลด :฿ ",sale)
    if order > 3:
        sale = price * order * 0.95
        print('ราคาสินค้ารวมส่วนลด :฿ ', sale)
else:
    sale = price * order
    print("ราคาสินค้าไม่มีส่วนลด : ",sale)